# JSON - PYTHON
#
# object - dict
# array - list
# string - str
# number (int) - int
# number (real) - float
# true - True
# false - False
# null - None

# 1. object - неупорядоченное множество пар "ключ-значение", заключённое в {}, по сути аналог словаря в Python
# 2. Название ключа обязательно заключается в ДВОЙНЫЕ кавычки
#
# 3. array - упорядоченная последовательность значений, разделённых запятыми, заключённая в [], по сути аналог списка в Python
# 4. В массив будут сконвертированы списки и кортежи
#
# 5. string - строка, обязательно залючается в ДВОЙНЫЕ кавычки
#
# 6. number (int) - целое число
# 7. number (real) - дробное число
#
# 8. данные в объекте или массиве разделяются запятыми

# # Пример
# {
#     "first_name": "Sonya",
#     "last_name": "Kargina",
#     "photo_50": "https://pp.vk.me/...2c1/J2EL--qCZa8.jpg",
#     "likes": 366
# }

# # Неправильный пример, объект или массив не может заканчиваться на запятую
# {
#     "first_name": "Sonya",
#     "last_name": "Kargina",
#     "photo_50": "https://pp.vk.me/...2c1/J2EL--qCZa8.jpg",
#     "likes": 366,
# }

#
#
#
#
#
#
#
#
#
#
#