# сериализация и десериализация данных
# процессы преобразования данных из одной формы в другую


# Python и JS отличаются в представлении своих типов данных
# True
# False
# None
# [1, 2, 3, 4]
# {'a': 1, 'b': 2, 'c': 3}
# 1
# 1.2
# 1_000_000
# 'a'
# """a"""

# true
# false
# null
# NaN
# [1, 2, 3, 4]
# {'a': 1, 'b': 2, 'c': 3}
# 1
# 1.2
# 1_000_000
# 'a'
# `a`

# PRO
# 1. передача данных по сети
# 2. хранение данных
# 3. интеграция разных систем
# 4. сохранение совместимости
# 5. человекочитаемость

# CONTRA
# 1. сложность
# 2. безопасность
# 3. совместимость
# 4. производительность