# общий вид обработчика исключений

# try:
#     # код, в котором мы хотим отловить исключения
# except <ExceptionType_1>:
#     # код, выполняемый при возникновении исключения ExceptionType_1
# except <ExceptionType_2>:
#     # код, выполняемый при возникновении исключения ExceptionType_2
# except <ExceptionType_3>:
#     # код, выполняемый при возникновении исключения ExceptionType_3
# except <ExceptionType_4>:
#     # код, выполняемый при возникновении исключения ExceptionType_4
# else:
#     # код, выполняемый при отсутствии исключений
# finally:
#     # код, выполняемый в любом случае