# def add_numbers(x, y):
#     return x + y


# class BankAccount:
#     def __init__(self, balance):
#         self.balance = balance

#     def deposit(self, amount):
#         """Вносим деньги на счет"""

#     def withdraw(self, amount):
#         """Снимаем деньги с счета"""

#     def get_balance(self):
#         """Получаем доступный баланс"""


# Абстракция - это процесс выделения существенных характеристик объекта 
# и игнорирования несущественных деталей.
# Абстракция используется в программировании для упрощения сложных задач
# и сокрытия деталей реализации.